Ran Plan for project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 64 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs_task_role.aws_iam_role_policy.custom["eventbridge-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-eventbridge-access"
        name        = "crawlinghub-web-api-task-role-prod-eventbridge-access"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ policy      = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-web-api-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```